## Data Cleaning

In [27]:
#IMPORTAR LIBRERIAS 
import pandas as pd
import numpy as np
import seaborn as sns 
import matplotlib.pyplot as plt 
import re

In [28]:
path = 'C:/Users/manya/Documents/Ironhack/Course/Project-1/data/attacks.csv'
df = pd.read_csv (path, encoding="cp1252")

In [29]:
df.columns

Index(['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time',
       'Species ', 'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

In [30]:
df

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,...,White shark,"R. Collier, GSAF",2018.06.25-Wolfe.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.25,2018.06.25,6303.0,NaN,NaN
1,2018.06.18,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,AdysonÂ McNeely,F,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.18-McNeely.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.18,2018.06.18,6302.0,NaN,NaN
2,2018.06.09,09-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.09-Denges.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.09,2018.06.09,6301.0,NaN,NaN
3,2018.06.08,08-Jun-2018,2018.0,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,male,M,...,2 m shark,"B. Myatt, GSAF",2018.06.08-Arrawarra.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.08,2018.06.08,6300.0,NaN,NaN
4,2018.06.04,04-Jun-2018,2018.0,Provoked,MEXICO,Colima,La Ticla,Free diving,Gustavo Ramos,M,...,"Tiger shark, 3m",A .Kipper,2018.06.04-Ramos.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.04,2018.06.04,6299.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25718,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25719,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25720,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25721,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25722,xx,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Limpieza general

### HipÃ³tesis: 

   - HipÃ³tesis 1: Â¿En quÃ© paÃ­s hay un porcentaje mÃ¡s elevado de muertes por ataques de tiburÃ³n?
   - HipÃ³tesis 2: Â¿En que estaciÃ³n del aÃ±o hay mÃ¡s riesgo de morir por un ataque de tiburÃ³n en estos paÃ­ses?
   - HipÃ³tesis 3: Â¿CuÃ¡les son las actividades con las que se producen mÃ¡s muertes?
   - HipÃ³tesis 4: Â¿En estos paÃ­ses mueren mÃ¡s mujeres o hombres?

A partir de mis hipÃ³tesis, decido dropear aquellas columnas que no me interesan y quedarme solamente con Case Number, Date, Year, Country, Activity y Fatal (Y/N).

In [31]:
df.drop(columns = ['Unnamed: 22', 'Unnamed: 23', 'Case Number.1', 'Case Number.2','href', 'href formula', 'pdf', 'Investigator or Source', 'Name', 'Age', 'Type', 'original order', 'Time','Area', 'Injury','Location','Species ','Year'],inplace = True)

In [32]:
df

      Case Number         Date    Country     Activity Sex  Fatal (Y/N)
0      2018.06.25  25-Jun-2018        USA     Paddling    F           N
1      2018.06.18  18-Jun-2018        USA     Standing    F           N
2      2018.06.09  09-Jun-2018        USA      Surfing    M           N
3      2018.06.08  08-Jun-2018  AUSTRALIA      Surfing    M           N
4      2018.06.04  04-Jun-2018     MEXICO  Free diving    M           N
...           ...          ...        ...          ...  ...         ...
25718         NaN          NaN        NaN          NaN  NaN         NaN
25719         NaN          NaN        NaN          NaN  NaN         NaN
25720         NaN          NaN        NaN          NaN  NaN         NaN
25721         NaN          NaN        NaN          NaN  NaN         NaN
25722          xx          NaN        NaN          NaN  NaN         NaN

[25723 rows x 6 columns]

Hay muchos valores nulos en todas las columnas llegando a haber muchas filas con todo de valores nulos que no me aportan informaciÃ³n. Por lo que dropeo todas las filas que tengan menos de 3 valores no nulos (7 nan) para hacer una primera limpieza.

In [33]:
df.isna ().sum()

Case Number    17021
Date           19421
Country        19471
Activity       19965
Sex            19986
Fatal (Y/N)    19960
dtype: int64

In [34]:
df.dropna (thresh = 3, inplace = True)
df

,Case Number,Date,Country,Activity,Sex,Fatal (Y/N)
0,2018.06.25,25-Jun-2018,USA,Paddling,F,N
1,2018.06.18,18-Jun-2018,USA,Standing,F,N
2,2018.06.09,09-Jun-2018,USA,Surfing,M,N
3,2018.06.08,08-Jun-2018,AUSTRALIA,Surfing,M,N
4,2018.06.04,04-Jun-2018,MEXICO,Free diving,M,N
...,...,...,...,...,...,...
6297,ND.0005,Before 1903,AUSTRALIA,Diving,M,Y
6298,ND.0004,Before 1903,AUSTRALIA,Pearl diving,M,Y
6299,ND.0003,1900-1905,USA,Swimming,M,Y
6300,ND.0002,1883-1889,PANAMA,NaN,M,Y
6301,ND.0001,1845-1853,CEYLON (SRI LANKA),Swimming,M,Y

In [35]:
df.isna().sum()

Case Number      1
Date             0
Country         50
Activity       544
Sex            565
Fatal (Y/N)    539
dtype: int64

DespuÃ©s de esta primera limpieza de columnas y filas, le doy el mismo formato a todas las etiquetas de las columnas

In [36]:
df.columns = [column.rstrip().rstrip(' (Y/N)').lower().replace(' ', '_') for column in df.columns]
df.columns

Index(['case_number', 'date', 'country', 'activity', 'sex', 'fatal'], dtype='object')

## Limpieza hipÃ³tesis 1: columnas country y fatal

1. Dropeo los valores nulos tanto de country como fatal

In [37]:
df.dropna(subset=['country','fatal'],inplace=True)
df

     case_number         date             country      activity sex fatal
0     2018.06.25  25-Jun-2018                 USA      Paddling   F     N
1     2018.06.18  18-Jun-2018                 USA      Standing   F     N
2     2018.06.09  09-Jun-2018                 USA       Surfing   M     N
3     2018.06.08  08-Jun-2018           AUSTRALIA       Surfing   M     N
4     2018.06.04  04-Jun-2018              MEXICO   Free diving   M     N
...          ...          ...                 ...           ...  ..   ...
6297     ND.0005  Before 1903           AUSTRALIA        Diving   M     Y
6298     ND.0004  Before 1903           AUSTRALIA  Pearl diving   M     Y
6299     ND.0003    1900-1905                 USA      Swimming   M     Y
6300     ND.0002    1883-1889              PANAMA           NaN   M     Y
6301     ND.0001    1845-1853  CEYLON (SRI LANKA)      Swimming   M     Y

[5718 rows x 6 columns]

In [38]:
df.isna().sum()

case_number      1
date             0
country          0
activity       412
sex            484
fatal            0
dtype: int64

### Columna fatal

In [39]:
df.fatal.unique()

array(['N', 'Y', 'M', 'UNKNOWN', '2017', ' N', 'N ', 'y'], dtype=object)

Compruebo si la columna fatal solo tiene los dos valores que deberÃ­a  Y (muerte) o N (supervivencia). No es el caso, procedo a limpiar los valores de fatal

In [40]:
df1 = df.copy()

In [41]:
#Cambio todos los valores por mayusculas y sin espacios
#Dropeo del data frame todos los valores que sean '2017', 'M' o 'UNKNOWN'

df1.fatal = df1.fatal.apply (lambda i: i.lstrip().rstrip().upper()) 
df1 = df1.drop(df1[(df1['fatal'] == '2017') | (df1['fatal'] == 'M')| (df1['fatal'] == 'UNKNOWN')].index)

In [42]:
df1.fatal.unique()

array(['N', 'Y'], dtype=object)

Creo una columna fatal numerica: 0,1

In [43]:
def fatal_numerica (x): 
    numero = 0
    if x == 'Y':
        numero = 1
    else:
        numero = 0
    return numero 

df1['fatal_numerica'] = df1['fatal'].apply(fatal_numerica)
df1

,case_number,date,country,activity,sex,fatal,fatal_numerica
0,2018.06.25,25-Jun-2018,USA,Paddling,F,N,0
1,2018.06.18,18-Jun-2018,USA,Standing,F,N,0
2,2018.06.09,09-Jun-2018,USA,Surfing,M,N,0
3,2018.06.08,08-Jun-2018,AUSTRALIA,Surfing,M,N,0
4,2018.06.04,04-Jun-2018,MEXICO,Free diving,M,N,0
...,...,...,...,...,...,...,...
6297,ND.0005,Before 1903,AUSTRALIA,Diving,M,Y,1
6298,ND.0004,Before 1903,AUSTRALIA,Pearl diving,M,Y,1
6299,ND.0003,1900-1905,USA,Swimming,M,Y,1
6300,ND.0002,1883-1889,PANAMA,NaN,M,Y,1
6301,ND.0001,1845-1853,CEYLON (SRI LANKA),Swimming,M,Y,1

### Columna country

In [44]:
df1.country.unique()

array(['USA', 'AUSTRALIA', 'MEXICO', 'BRAZIL', 'ENGLAND', 'SOUTH AFRICA',
       'THAILAND', 'COSTA RICA', 'MALDIVES', 'BAHAMAS', 'NEW CALEDONIA',
       'ECUADOR', 'MALAYSIA', 'LIBYA', 'CUBA', 'MAURITIUS', 'NEW ZEALAND',
       'SPAIN', 'SAMOA', 'SOLOMON ISLANDS', 'JAPAN', 'EGYPT',
       'ST HELENA, British overseas territory', 'REUNION',
       'FRENCH POLYNESIA', 'UNITED KINGDOM', 'UNITED ARAB EMIRATES',
       'PHILIPPINES', 'INDONESIA', 'CHINA', 'COLUMBIA', 'Fiji',
       'DOMINICAN REPUBLIC', 'ARUBA', 'MOZAMBIQUE', 'FIJI', 'PUERTO RICO',
       'ATLANTIC OCEAN', 'GREECE', 'ST. MARTIN', 'FRANCE',
       'PAPUA NEW GUINEA', 'TRINIDAD & TOBAGO', 'KIRIBATI', 'ISRAEL',
       'DIEGO GARCIA', 'TAIWAN', 'PALESTINIAN TERRITORIES', 'GUAM',
       'SEYCHELLES', 'BELIZE', 'JAMAICA', 'NIGERIA', 'TONGA', 'SCOTLAND',
       'CHILE', 'KENYA', 'RUSSIA', 'TURKS & CAICOS', 'AZORES',
       'SOUTH KOREA', 'MALTA', 'VIETNAM', 'MADAGASCAR',
       'UNITED ARAB EMIRATES (UAE)', 'PANAMA', 'SOMALIA', 'CROATIA',
       'NORWAY', 'YEMEN', 'GULF OF ADEN', 'ITALY', 'Sierra Leone',
       'ST. MAARTIN', 'GRAND CAYMAN', 'VANUATU', 'MEXICO ', 'VENEZUELA',
       ' TONGA', 'URUGUAY', 'INDIA', 'MICRONESIA', 'CARIBBEAN SEA',
       'CANADA', 'OKINAWA', 'TANZANIA', 'MARSHALL ISLANDS', 'SENEGAL',
       'EGYPT / ISRAEL', 'NORTHERN ARABIAN SEA', 'HONG KONG',
       'EL SALVADOR', 'ANGOLA', 'IRAN', 'TUNISIA', 'NAMIBIA', 'BERMUDA',
       'NORTH ATLANTIC OCEAN', 'PORTUGAL', 'SOUTH CHINA SEA',
       'BANGLADESH', 'PALAU', 'WESTERN SAMOA', 'PACIFIC OCEAN ',
       'BRITISH ISLES', 'GRENADA', 'SRI LANKA', 'IRAQ', 'TURKEY',
       'SINGAPORE', 'NEW BRITAIN', 'SUDAN', 'JOHNSTON ISLAND',
       'SOUTH PACIFIC OCEAN', 'NEW GUINEA', 'RED SEA',
       'NORTH PACIFIC OCEAN', 'FEDERATED STATES OF MICRONESIA',
       'MID ATLANTIC OCEAN', 'ADMIRALTY ISLANDS', 'BRITISH WEST INDIES',
       'SOUTH ATLANTIC OCEAN', 'PERSIAN GULF', 'RED SEA / INDIAN OCEAN',
       'PACIFIC OCEAN', 'NORTH SEA', 'NICARAGUA ', 'MALDIVE ISLANDS',
       'AMERICAN SAMOA', 'ANDAMAN / NICOBAR ISLANDAS', 'GABON', 'MAYOTTE',
       'NORTH ATLANTIC OCEAN ', 'MONTENEGRO', 'THE BALKANS', 'SUDAN?',
       'ARGENTINA', 'MARTINIQUE', 'INDIAN OCEAN', 'NETHERLANDS ANTILLES',
       'LIBERIA', 'SAUDI ARABIA', 'NORTHERN MARIANA ISLANDS',
       'IRAN / IRAQ', 'JAVA', 'SIERRA LEONE', ' PHILIPPINES', 'NICARAGUA',
       'CENTRAL PACIFIC', 'SOLOMON ISLANDS / VANUATU',
       'SOUTHWEST PACIFIC OCEAN', 'BAY OF BENGAL', 'MID-PACIFC OCEAN',
       'SLOVENIA', 'CURACAO', 'ICELAND', 'BARBADOS', 'CAPE VERDE',
       'HONDURAS', 'MONACO', 'GUYANA', 'HAITI', 'SAN DOMINGO', 'IRELAND',
       'KUWAIT', 'YEMEN ', 'REUNION ISLAND', 'FALKLAND ISLANDS', 'CRETE',
       'CYPRUS', 'EGYPT ', 'WEST INDIES', 'BURMA', 'LEBANON', 'PARAGUAY',
       'BRITISH NEW GUINEA', 'CEYLON', 'OCEAN', 'GEORGIA', 'TUVALU',
       'INDIAN OCEAN?', 'GUINEA', 'ANDAMAN ISLANDS',
       'EQUATORIAL GUINEA / CAMEROON', 'COOK ISLANDS', 'TOBAGO', 'PERU',
       'AFRICA', 'ALGERIA', 'Coast of AFRICA', 'TASMAN SEA', 'GHANA',
       'GREENLAND', 'MEDITERRANEAN SEA', 'Between PORTUGAL & INDIA',
       'DJIBOUTI', 'BAHREIN', 'KOREA', 'RED SEA?', 'ASIA?',
       'CEYLON (SRI LANKA)'], dtype=object)

1. Exploro todos los valores de la columna y decido: 
    - Todos los paÃ­ses en mayuscula y mismo formato.
    - Borrar si la string contiene OCEAN, PACIFIC, MEDITERRANEAN, Between, NORTHERN ARABIAN, THE BALKANS, SEA, AFRICA, ASIA ya que no son paÃ­ses
    - Borrar los ? de una string. Ej: RED SEA?
    - UNITED ARAB EMIRATES (UAE) quedarme con UNITED ARAB EMIRATES 
    - En lugar de ENGLAND, quedarme con UNITED KINGDOM

In [45]:
df1['country']= df1['country'].apply (lambda i: i.lstrip().rstrip().upper()) #Mismo formato para todas las strings

In [46]:
#Creo una lista de todas las substrings que quiero dropear 
discard = ['OCEAN','PACIFIC','MEDITERRANEAN','RED','BETWEEN','AFRICA','ASIA','/','GULF','NORTHERN ARABIAN','THE BALKANS','NORTH SEA','TASMAN','SOUTH CHINA'] #Substring que quiero identificar  
df1 = df1[~df1.country.str.contains('|'.join(discard))] #Dropeo aquellas strings que contengan discard
df1.country.unique()

array(['USA', 'AUSTRALIA', 'MEXICO', 'BRAZIL', 'ENGLAND', 'THAILAND',
       'COSTA RICA', 'MALDIVES', 'BAHAMAS', 'NEW CALEDONIA', 'ECUADOR',
       'MALAYSIA', 'LIBYA', 'CUBA', 'MAURITIUS', 'NEW ZEALAND', 'SPAIN',
       'SAMOA', 'SOLOMON ISLANDS', 'JAPAN', 'EGYPT',
       'ST HELENA, BRITISH OVERSEAS TERRITORY', 'REUNION',
       'FRENCH POLYNESIA', 'UNITED KINGDOM', 'UNITED ARAB EMIRATES',
       'PHILIPPINES', 'INDONESIA', 'CHINA', 'COLUMBIA', 'FIJI',
       'DOMINICAN REPUBLIC', 'ARUBA', 'MOZAMBIQUE', 'PUERTO RICO',
       'GREECE', 'ST. MARTIN', 'FRANCE', 'PAPUA NEW GUINEA',
       'TRINIDAD & TOBAGO', 'KIRIBATI', 'ISRAEL', 'DIEGO GARCIA',
       'TAIWAN', 'PALESTINIAN TERRITORIES', 'GUAM', 'SEYCHELLES',
       'BELIZE', 'JAMAICA', 'NIGERIA', 'TONGA', 'SCOTLAND', 'CHILE',
       'KENYA', 'RUSSIA', 'TURKS & CAICOS', 'AZORES', 'SOUTH KOREA',
       'MALTA', 'VIETNAM', 'MADAGASCAR', 'UNITED ARAB EMIRATES (UAE)',
       'PANAMA', 'SOMALIA', 'CROATIA', 'NORWAY', 'YEMEN', 'ITALY',
       'SIERRA LEONE', 'ST. MAARTIN', 'GRAND CAYMAN', 'VANUATU',
       'VENEZUELA', 'URUGUAY', 'INDIA', 'MICRONESIA', 'CARIBBEAN SEA',
       'CANADA', 'OKINAWA', 'TANZANIA', 'MARSHALL ISLANDS', 'SENEGAL',
       'HONG KONG', 'EL SALVADOR', 'ANGOLA', 'IRAN', 'TUNISIA', 'NAMIBIA',
       'BERMUDA', 'PORTUGAL', 'BANGLADESH', 'PALAU', 'WESTERN SAMOA',
       'BRITISH ISLES', 'GRENADA', 'SRI LANKA', 'IRAQ', 'TURKEY',
       'SINGAPORE', 'NEW BRITAIN', 'SUDAN', 'JOHNSTON ISLAND',
       'NEW GUINEA', 'FEDERATED STATES OF MICRONESIA',
       'ADMIRALTY ISLANDS', 'BRITISH WEST INDIES', 'NICARAGUA',
       'MALDIVE ISLANDS', 'AMERICAN SAMOA', 'GABON', 'MAYOTTE',
       'MONTENEGRO', 'SUDAN?', 'ARGENTINA', 'MARTINIQUE',
       'NETHERLANDS ANTILLES', 'LIBERIA', 'SAUDI ARABIA',
       'NORTHERN MARIANA ISLANDS', 'JAVA', 'BAY OF BENGAL', 'SLOVENIA',
       'CURACAO', 'ICELAND', 'BARBADOS', 'CAPE VERDE', 'HONDURAS',
       'MONACO', 'GUYANA', 'HAITI', 'SAN DOMINGO', 'IRELAND', 'KUWAIT',
       'REUNION ISLAND', 'FALKLAND ISLANDS', 'CRETE', 'CYPRUS',
       'WEST INDIES', 'BURMA', 'LEBANON', 'PARAGUAY',
       'BRITISH NEW GUINEA', 'CEYLON', 'GEORGIA', 'TUVALU', 'GUINEA',
       'ANDAMAN ISLANDS', 'COOK ISLANDS', 'TOBAGO', 'PERU', 'ALGERIA',
       'GHANA', 'GREENLAND', 'DJIBOUTI', 'BAHREIN', 'KOREA',
       'CEYLON (SRI LANKA)'], dtype=object)

In [47]:
df2 = df1.copy()

In [48]:
#Cambio aquellos valores que estan mal escritos o asignados
df2.country = df2.country.apply (lambda i: i.replace('UNITED ARAB EMIRATES (UAE)','UNITED ARAB EMIRATES'))
df2.country = df2.country.apply (lambda i: i.replace('SUDAN?','SUDAN'))
df2.country = df2.country.apply (lambda i: i.replace('CEYLON (SRI LANKA)','SRI LANKA'))
df2.country = df2.country.apply (lambda i: i.replace('ENGLAND','UNITED KINGDOM'))

In [49]:
df2.sample(20)

,case_number,date,country,activity,sex,fatal,fatal_numerica
1731,2003.10.06,06-Oct-2003,USA,Swimming to shore from boat or kayak,M,Y,1
5544,1901.09.23.R,Reported 23-Sep-1901,CYPRUS,Swimming,M,Y,1
2520,1992.11.25.a,25-Nov-1992,USA,Surfing,M,N,0
5955,1863.04.00,Apr-1863,AUSTRALIA,Launching a boat,M,Y,1
3837,1962.02.04,04-Feb-1962,AUSTRALIA,Swimming,M,N,0
3497,1967.11.30.b,30-Nov-1967,AUSTRALIA,Freediving,M,N,0
6263,ND.0040,1941-1945,IRAN,NaN,M,Y,1
6128,1803.05.17,May-17-1803,USA,NaN,M,N,0
2867,1985.00.00.f,1985,VANUATU,NaN,M,Y,1
1604,2005.03.19,19-Mar-2005,AUSTRALIA,Snorkeling,M,Y,1
2988,1982.02.27,27-Feb-1982,USA,Surfing,M,N,0
4114,1959.01.17.b,17-Jan-1959,AUSTRALIA,In deep water about 100 yards from his ship,M,Y,1
2222,1997.10.04,04-Oct-1997,USA,Swimming,F,N,0
6120,1810.09.15,15-Sep-1810,USA,Fell into the water,M,Y,1
4094,1959.05.16,16-May-1959,USA,NaN,F,N,0
5147,1926.07.12,12-Jul-1926,USA,Fishing,M,N,0
5128,1927.04.10,20-Apr-1927,AUSTRALIA,Diving,M,N,0
6038,1848.07.00,Jul-1848,UNITED KINGDOM,Standing,M,N,0
3352,1971.10.23,23-Oct-1971,USA,Surfing,M,N,0
5880,1874.07.23,23-Jul-1874,FRANCE,Fishing,NaN,N,0

### Limpieza hipotesis 2: columna date, columna case_number, columnas nuevas de mes y estaciÃ³n

Para la segunda hipotesis debo:

    - Limpiar columna date: dropear los nan y todos aquellos valores que no contengan el mes 
    - Limpiar columna case_number: dropear nan, formato, los que no contengan el mes fuera
    - Crear una columna nueva donde poner los meses 
    - Hemisferio norte, hemisferio sur? EstaciÃ³n?

Dropear de las columnas existentes como date, case_number y year los nanvalues

In [50]:
df2.dropna(subset=['date','case_number'],inplace=True)
df2

,case_number,date,country,activity,sex,fatal,fatal_numerica
0,2018.06.25,25-Jun-2018,USA,Paddling,F,N,0
1,2018.06.18,18-Jun-2018,USA,Standing,F,N,0
2,2018.06.09,09-Jun-2018,USA,Surfing,M,N,0
3,2018.06.08,08-Jun-2018,AUSTRALIA,Surfing,M,N,0
4,2018.06.04,04-Jun-2018,MEXICO,Free diving,M,N,0
...,...,...,...,...,...,...,...
6297,ND.0005,Before 1903,AUSTRALIA,Diving,M,Y,1
6298,ND.0004,Before 1903,AUSTRALIA,Pearl diving,M,Y,1
6299,ND.0003,1900-1905,USA,Swimming,M,Y,1
6300,ND.0002,1883-1889,PANAMA,NaN,M,Y,1
6301,ND.0001,1845-1853,SRI LANKA,Swimming,M,Y,1

### Columna case_number

In [51]:
df2.case_number.value_counts()

1966.12.26      2
2012.09.02.b    2
1990.05.10      2
2013.10.05      2
1980.07.00      2
               ..
2001.04.11.d    1
2001.04.12.a    1
2001.04.12.b    1
2001.04.12.c    1
ND.0001         1
Name: case_number, Length: 5024, dtype: int64

Veo que en la columna case_number hay valores que terminan en .letra, por lo que uso regex para quitar este sufijo

In [52]:
#Remove suffix .letra usando regex, pj.ej: 2001.04.11.d transformar a 2001.04.11
df2['case_number']=df2['case_number'].str.replace(r'\.\w$', '', regex=True)
df2.case_number.unique()

array(['2018.06.25', '2018.06.18', '2018.06.09', ..., 'ND.0003',
       'ND.0002', 'ND.0001'], dtype=object)

Creo una nueva columna que chequea si los valores de la columna case_number tienen el formato xxxx.xx.xx y contienen el mes

In [53]:
def check_format_case (x):
    check = 0
    if re.search ('^\d{4}.\d{2}.\d{2}', str(x)) and str(x)[5:7] != '00': #busca si el valor de la columna tiene este patron de regex y contiene un mes 
        check = True 
    else:
        check = False
    return check #Devuelves check que es lo que quieres aplicar ala nueva columna
        
df2['case_check'] = df2['case_number'].apply(check_format_case) #Aplicas esta funciÃ³n a cada uno de los valores de la column case que se aÃ±adira en la nueva columna

In [54]:
df2.loc[4351]

case_number       1954.00.00
date                    1954
country                 IRAN
activity                 NaN
sex                        M
fatal                      Y
fatal_numerica             1
case_check             False
Name: 4351, dtype: object

### Columna date

In [55]:
def check_format_date (x):
    check = 0
    if re.search ("^\s*\d{1,2}-\w{3,}-\d{2,4}", x): #busca si el valor de la columna df.date tiene este patron de regex
        check = True 
    else:
        check = False
    return check #Devuelves check que es lo que quieres aplicar ala nueva columna
        
df2['date_check'] = df2['date'].apply(check_format_date) #Aplicas esta funciÃ³n a cada uno de los valores de la column date que se aÃ±adira en la nueva columna

In [56]:
df2

,case_number,date,country,activity,sex,fatal,fatal_numerica,case_check,date_check
0,2018.06.25,25-Jun-2018,USA,Paddling,F,N,0,True,True
1,2018.06.18,18-Jun-2018,USA,Standing,F,N,0,True,True
2,2018.06.09,09-Jun-2018,USA,Surfing,M,N,0,True,True
3,2018.06.08,08-Jun-2018,AUSTRALIA,Surfing,M,N,0,True,True
4,2018.06.04,04-Jun-2018,MEXICO,Free diving,M,N,0,True,True
...,...,...,...,...,...,...,...,...,...
6297,ND.0005,Before 1903,AUSTRALIA,Diving,M,Y,1,False,False
6298,ND.0004,Before 1903,AUSTRALIA,Pearl diving,M,Y,1,False,False
6299,ND.0003,1900-1905,USA,Swimming,M,Y,1,False,False
6300,ND.0002,1883-1889,PANAMA,NaN,M,Y,1,False,False
6301,ND.0001,1845-1853,SRI LANKA,Swimming,M,Y,1,False,False

No quiero perder rows que contengan month, ya sea que lo tengan en la columna date o la columna case_number.

    - Mantener filas si TRUE en case_check y date_check 
    - Dropear filas si FALSE en case_check y date_check
    - Si una fila tiene TRUE en alguna de las dos y FALSE en la otra, revisar el contenido

In [57]:
df2 = df2.drop(df2[(df2['case_check'] == False) & (df2['date_check'] == False)].index)
df2

,case_number,date,country,activity,sex,fatal,fatal_numerica,case_check,date_check
0,2018.06.25,25-Jun-2018,USA,Paddling,F,N,0,True,True
1,2018.06.18,18-Jun-2018,USA,Standing,F,N,0,True,True
2,2018.06.09,09-Jun-2018,USA,Surfing,M,N,0,True,True
3,2018.06.08,08-Jun-2018,AUSTRALIA,Surfing,M,N,0,True,True
4,2018.06.04,04-Jun-2018,MEXICO,Free diving,M,N,0,True,True
...,...,...,...,...,...,...,...,...,...
6150,1753.10.27,Reported 27-Oct-1753,JAMAICA,Fell overboard,M,Y,1,True,False
6151,1751.07.27,27-Jul-1751,USA,Swimming,M,Y,1,True,True
6156,1738.04.06,Reported 06-Apr-1738,ITALY,Swimming,M,Y,1,True,False
6159,1721.06.00,June 1721,ITALY,Swimming,M,Y,1,True,False
6160,1703.03.26,26-Mar-1703,BARBADOS,Swimming,M,N,0,True,True

In [58]:
df2.case_check.unique()

array([ True])

Creo una copia del data frame donde dropeo: 
    
   - La columna date: todos los valores de case_number son TRUE por lo que ya me quedo con esta columna que contiene los meses y no hace falta que limpie la columna date
   - Las columnas case_check y date_check que ya no me hacen falta

In [59]:
df3 = df2.copy()
df3.drop (columns = ['date','date_check','case_check'], inplace = True)

### Columnas nuevas de: Months, hemisferio y estaciones del aÃ±o

Como lo hago? 
- Creo una columna month con los valores [5:7] de case_number
- Creo una columna de hemisferio segun el pais
- Creo otra columna de estaciÃ³n del aÃ±o que me diga la estaciÃ³n del aÃ±o segÃºn el mes y el hemisferio en el que se encuentra el paÃ­s

In [60]:
#Columna month
df3['month'] = df3['case_number'].apply(lambda i: i[5:7])
df3['month'] =pd.to_numeric (df3['month'])

Importo un data set que contiene la latitud de todos los paÃ­ses. Agrego la columna de latitude a mi data set para poder determinar en que hemisferio se encuentra cada paÃ­s y en que estaciÃ³n del aÃ±o se ha producido el ataque de tiburÃ³n.

In [61]:
path = 'C:/Users/manya/Documents/Ironhack/Course/Project-1/data/countries_lat_lon.csv'
df_lat = pd.read_csv (path, encoding="cp1252")

Dropeo del dataset de latitudes las columnas que no me interesan

In [62]:
df_lat.drop(columns=['country_code','usa_state_code','usa_state_latitude','usa_state_longitude','usa_state'], inplace=True)

In [63]:
sorted (df_lat.country.unique())

['Afghanistan',
 'Albania',
 'Algeria',
 'American Samoa',
 'Andorra',
 'Angola',
 'Anguilla',
 'Antarctica',
 'Antigua and Barbuda',
 'Argentina',
 'Armenia',
 'Aruba',
 'Australia',
 'Austria',
 'Azerbaijan',
 'Bahamas',
 'Bahrain',
 'Bangladesh',
 'Barbados',
 'Belarus',
 'Belgium',
 'Belize',
 'Benin',
 'Bermuda',
 'Bhutan',
 'Bolivia',
 'Bosnia and Herzegovina',
 'Botswana',
 'Bouvet Island',
 'Brazil',
 'British Indian Ocean Territory',
 'British Virgin Islands',
 'Brunei',
 'Bulgaria',
 'Burkina Faso',
 'Burundi',
 'Cambodia',
 'Cameroon',
 'Canada',
 'Cape Verde',
 'Cayman Islands',
 'Central African Republic',
 'Chad',
 'Chile',
 'China',
 'Christmas Island',
 'Cocos [Keeling] Islands',
 'Colombia',
 'Comoros',
 'Congo [DRC]',
 'Congo [Republic]',
 'Cook Islands',
 'Costa Rica',
 'Croatia',
 'Cuba',
 'Cyprus',
 'Czech Republic',
 "CÃÂ´te d'Ivoire",
 'Denmark',
 'Djibouti',
 'Dominica',
 'Dominican Republic',
 'Ecuador',
 'Egypt',
 'El Salvador',
 'Equatorial Guinea',
 'Eritrea',
 'Estonia',
 'Ethiopia',
 'Falkland Islands [Islas Malvinas]',
 'Faroe Islands',
 'Fiji',
 'Finland',
 'France',
 'French Guiana',
 'French Polynesia',
 'French Southern Territories',
 'Gabon',
 'Gambia',
 'Gaza Strip',
 'Georgia',
 'Germany',
 'Ghana',
 'Gibraltar',
 'Greece',
 'Greenland',
 'Grenada',
 'Guadeloupe',
 'Guam',
 'Guatemala',
 'Guernsey',
 'Guinea',
 'Guinea-Bissau',
 'Guyana',
 'Haiti',
 'Heard Island and McDonald Islands',
 'Honduras',
 'Hong Kong',
 'Hungary',
 'Iceland',
 'India',
 'Indonesia',
 'Iran',
 'Iraq',
 'Ireland',
 'Isle of Man',
 'Israel',
 'Italy',
 'Jamaica',
 'Japan',
 'Jersey',
 'Jordan',
 'Kazakhstan',
 'Kenya',
 'Kiribati',
 'Kosovo',
 'Kuwait',
 'Kyrgyzstan',
 'Laos',
 'Latvia',
 'Lebanon',
 'Lesotho',
 'Liberia',
 'Libya',
 'Liechtenstein',
 'Lithuania',
 'Luxembourg',
 'Macau',
 'Macedonia [FYROM]',
 'Madagascar',
 'Malawi',
 'Malaysia',
 'Maldives',
 'Mali',
 'Malta',
 'Marshall Islands',
 'Martinique',
 'Mauritania',
 'Mauritius',
 'Mayotte',
 'Mexico',
 'Micronesia',
 'Moldova',
 'Monaco',
 'Mongolia',
 'Montenegro',
 'Montserrat',
 'Morocco',
 'Mozambique',
 'Myanmar [Burma]',
 'Namibia',
 'Nauru',
 'Nepal',
 'Netherlands',
 'Netherlands Antilles',
 'New Caledonia',
 'New Zealand',
 'Nicaragua',
 'Niger',
 'Nigeria',
 'Niue',
 'Norfolk Island',
 'North Korea',
 'Northern Mariana Islands',
 'Norway',
 'Oman',
 'Pakistan',
 'Palau',
 'Palestinian Territories',
 'Panama',
 'Papua New Guinea',
 'Paraguay',
 'Peru',
 'Philippines',
 'Pitcairn Islands',
 'Poland',
 'Portugal',
 'Puerto Rico',
 'Qatar',
 'Romania',
 'Russia',
 'Rwanda',
 'RÃÂ©union',
 'Saint Helena',
 'Saint Kitts and Nevis',
 'Saint Lucia',
 'Saint Pierre and Miquelon',
 'Saint Vincent and the Grenadines',
 'Samoa',
 'San Marino',
 'Saudi Arabia',
 'Senegal',
 'Serbia',
 'Seychelles',
 'Sierra Leone',
 'Singapore',
 'Slovakia',
 'Slovenia',
 'Solomon Islands',
 'Somalia',
 'South Africa',
 'South Georgia and the South Sandwich Islands',
 'South Korea',
 'Spain',
 'Sri Lanka',
 'Sudan',
 'Suriname',
 'Svalbard and Jan Mayen',
 'Swaziland',
 'Sweden',
 'Switzerland',
 'Syria',
 'SÃÂ£o TomÃÂ© and PrÃ\xadncipe',
 'Taiwan',
 'Tajikistan',
 'Tanzania',
 'Thailand',
 'Timor-Leste',
 'Togo',
 'Tokelau',
 'Tonga',
 'Trinidad and Tobago',
 'Tunisia',
 'Turkey',
 'Turkmenistan',
 'Turks and Caicos Islands',
 'Tuvalu',
 'U.S. Minor Outlying Islands',
 'U.S. Virgin Islands',
 'Uganda',
 'Ukraine',
 'United Arab Emirates',
 'United Kingdom',
 'United States',
 'Uruguay',
 'Uzbekistan',
 'Vanuatu',
 'Vatican City',
 'Venezuela',
 'Vietnam',
 'Wallis and Futuna',
 'Western Sahara',
 'Yemen',
 'Zambia',
 'Zimbabwe']

In [64]:
sorted(df3.country.unique())

['ADMIRALTY ISLANDS',
 'ALGERIA',
 'AMERICAN SAMOA',
 'ARGENTINA',
 'ARUBA',
 'AUSTRALIA',
 'AZORES',
 'BAHAMAS',
 'BANGLADESH',
 'BARBADOS',
 'BAY OF BENGAL',
 'BELIZE',
 'BERMUDA',
 'BRAZIL',
 'BRITISH ISLES',
 'BRITISH NEW GUINEA',
 'BRITISH WEST INDIES',
 'BURMA',
 'CANADA',
 'CAPE VERDE',
 'CARIBBEAN SEA',
 'CEYLON',
 'CHILE',
 'CHINA',
 'COLUMBIA',
 'COOK ISLANDS',
 'COSTA RICA',
 'CROATIA',
 'CUBA',
 'CYPRUS',
 'DIEGO GARCIA',
 'DOMINICAN REPUBLIC',
 'ECUADOR',
 'EGYPT',
 'EL SALVADOR',
 'FALKLAND ISLANDS',
 'FEDERATED STATES OF MICRONESIA',
 'FIJI',
 'FRANCE',
 'FRENCH POLYNESIA',
 'GABON',
 'GEORGIA',
 'GHANA',
 'GRAND CAYMAN',
 'GREECE',
 'GRENADA',
 'GUAM',
 'GUINEA',
 'GUYANA',
 'HAITI',
 'HONDURAS',
 'HONG KONG',
 'ICELAND',
 'INDIA',
 'INDONESIA',
 'IRAN',
 'IRAQ',
 'IRELAND',
 'ISRAEL',
 'ITALY',
 'JAMAICA',
 'JAPAN',
 'JAVA',
 'JOHNSTON ISLAND',
 'KENYA',
 'KIRIBATI',
 'KUWAIT',
 'LEBANON',
 'LIBYA',
 'MADAGASCAR',
 'MALAYSIA',
 'MALDIVE ISLANDS',
 'MALDIVES',
 'MALTA',
 'MARSHALL ISLANDS',
 'MARTINIQUE',
 'MAURITIUS',
 'MAYOTTE',
 'MEXICO',
 'MICRONESIA',
 'MONTENEGRO',
 'MOZAMBIQUE',
 'NAMIBIA',
 'NETHERLANDS ANTILLES',
 'NEW BRITAIN',
 'NEW CALEDONIA',
 'NEW GUINEA',
 'NEW ZEALAND',
 'NICARAGUA',
 'NIGERIA',
 'NORTHERN MARIANA ISLANDS',
 'NORWAY',
 'OKINAWA',
 'PALAU',
 'PALESTINIAN TERRITORIES',
 'PANAMA',
 'PAPUA NEW GUINEA',
 'PARAGUAY',
 'PERU',
 'PHILIPPINES',
 'PORTUGAL',
 'PUERTO RICO',
 'REUNION',
 'RUSSIA',
 'SAMOA',
 'SAN DOMINGO',
 'SAUDI ARABIA',
 'SCOTLAND',
 'SENEGAL',
 'SEYCHELLES',
 'SIERRA LEONE',
 'SINGAPORE',
 'SOLOMON ISLANDS',
 'SOMALIA',
 'SOUTH KOREA',
 'SPAIN',
 'SRI LANKA',
 'ST HELENA, BRITISH OVERSEAS TERRITORY',
 'ST. MAARTIN',
 'ST. MARTIN',
 'SUDAN',
 'TAIWAN',
 'TANZANIA',
 'THAILAND',
 'TOBAGO',
 'TONGA',
 'TRINIDAD & TOBAGO',
 'TUNISIA',
 'TURKEY',
 'TURKS & CAICOS',
 'TUVALU',
 'UNITED ARAB EMIRATES',
 'UNITED KINGDOM',
 'URUGUAY',
 'USA',
 'VANUATU',
 'VENEZUELA',
 'VIETNAM',
 'WEST INDIES',
 'WESTERN SAMOA',
 'YEMEN']

In [65]:
df_lat.country = df_lat.country.apply(lambda i: i.upper()) #en mayusculas toda la columna de paÃ­ses del nuevo dataset
df_lat.columns

Index(['latitude', 'longitude', 'country'], dtype='object')

In [66]:
df4 = df3.copy()

Observo que en algunos de los nombres de los paÃ­ses del dataframe de latitudes no tienen el mismo formato que en el dataframe de sharks. He identificado de forma manual los que no coinciden y cambio los nombres del dataframe de latitude

In [67]:
df_lat.country = df_lat.country.apply (lambda i: i.replace('RÃÂ©UNION','REUNION'))
df_lat.country = df_lat.country.apply (lambda i: i.replace('TURKS AND CAICOS ISLANDS','TURKS & CAICOS'))
df_lat.country = df_lat.country.apply (lambda i: i.replace('UNITED STATES','USA'))

Realizo un merge para agregar la columna de latitude a mi dataframe de shark en base a la coincidencia de la columna country.

In [68]:
df4 = pd.merge(df4, df_lat[['country', 'latitude']], on='country', how='left')

In [69]:
df4.latitude.isna().sum()

67

In [70]:
df4.dropna(subset=['latitude'],inplace = True)

In [71]:
df4

,case_number,country,activity,sex,fatal,fatal_numerica,month,latitude
0,2018.06.25,USA,Paddling,F,N,0,6,37.090240
1,2018.06.18,USA,Standing,F,N,0,6,37.090240
2,2018.06.09,USA,Surfing,M,N,0,6,37.090240
3,2018.06.08,AUSTRALIA,Surfing,M,N,0,6,-25.274398
4,2018.06.04,MEXICO,Free diving,M,N,0,6,23.634501
...,...,...,...,...,...,...,...,...
4616,1753.10.27,JAMAICA,Fell overboard,M,Y,1,10,18.109581
4617,1751.07.27,USA,Swimming,M,Y,1,7,37.090240
4618,1738.04.06,ITALY,Swimming,M,Y,1,4,41.871940
4619,1721.06.00,ITALY,Swimming,M,Y,1,6,41.871940
4620,1703.03.26,BARBADOS,Swimming,M,N,0,3,13.193887

Ahora que ya tengo las latitudes de todos los paÃ­ses, creo la columna month:

ESTACIONES METEOROLÃGICAS:

HEMISFERIO NORTE: 0<=latitude<=90
  - Primavera: 1 marzo hasta 31 mayo
  - Verano: 1 junio hasta 31 agosto
  - OtoÃ±o: 1 septiembre hasta 30 noviembre
  - Invierno: 1 diciembre hasta 28 febrero
    
HEMISFERIO SUR: -90 <= latitude <=0
   - Primavera: 1 septiembre hasta 30 noviembre
   - Verano: 1 diciembre hasta 28 febrero
   - OtoÃ±o: 1 marzo hasta 31 mayo
   - Invierno: 1 junio hasta 31 agosto

In [72]:
df5 =df4.copy()

In [73]:
# Creo una columna nueva hemisphere. 
df5['hemisphere'] = ''
df5.loc[df5['latitude'] >= 0, 'hemisphere'] = 'North'
df5.loc[df5['latitude'] < 0, 'hemisphere'] = 'South'
df5

,case_number,country,activity,sex,fatal,fatal_numerica,month,latitude,hemisphere
0,2018.06.25,USA,Paddling,F,N,0,6,37.090240,North
1,2018.06.18,USA,Standing,F,N,0,6,37.090240,North
2,2018.06.09,USA,Surfing,M,N,0,6,37.090240,North
3,2018.06.08,AUSTRALIA,Surfing,M,N,0,6,-25.274398,South
4,2018.06.04,MEXICO,Free diving,M,N,0,6,23.634501,North
...,...,...,...,...,...,...,...,...,...
4616,1753.10.27,JAMAICA,Fell overboard,M,Y,1,10,18.109581,North
4617,1751.07.27,USA,Swimming,M,Y,1,7,37.090240,North
4618,1738.04.06,ITALY,Swimming,M,Y,1,4,41.871940,North
4619,1721.06.00,ITALY,Swimming,M,Y,1,6,41.871940,North
4620,1703.03.26,BARBADOS,Swimming,M,N,0,3,13.193887,North

In [74]:
#Definir funciÃ³n para estaciÃ³n que se aplicarÃ¡ a dos columnas (latitude y hemisferio) para obtener una columna nueva estaciÃ³n

def funcion_estacion(row):
    estacion = 0
    month = row['month']
    hemisferio = row['hemisphere']
    if hemisferio == 'North': #Hemisferio norte
        if  3 <= month <= 5:
            estacion = 'Spring'
        elif 6 <= month <= 8:
            estacion = 'Summer'
        elif 9 <= month <= 11:
            estacion = 'Autumn'
        else: 
            estacion = 'Winter'
                
    else: #Hemisferio sur
        if  3 <= month <= 5:
            estacion ='Autumn'
        elif 6 <= month <= 8:
            estacion = 'Winter'
        elif 9 <= month <= 11:
            estacion = 'Spring'
        else: 
            estacion = 'Summer'
    return estacion                                

df5['season'] = df5[['month','hemisphere']].apply(funcion_estacion, axis=1)                       
df5

,case_number,country,activity,sex,fatal,fatal_numerica,month,latitude,hemisphere,season
0,2018.06.25,USA,Paddling,F,N,0,6,37.090240,North,Summer
1,2018.06.18,USA,Standing,F,N,0,6,37.090240,North,Summer
2,2018.06.09,USA,Surfing,M,N,0,6,37.090240,North,Summer
3,2018.06.08,AUSTRALIA,Surfing,M,N,0,6,-25.274398,South,Winter
4,2018.06.04,MEXICO,Free diving,M,N,0,6,23.634501,North,Summer
...,...,...,...,...,...,...,...,...,...,...
4616,1753.10.27,JAMAICA,Fell overboard,M,Y,1,10,18.109581,North,Autumn
4617,1751.07.27,USA,Swimming,M,Y,1,7,37.090240,North,Summer
4618,1738.04.06,ITALY,Swimming,M,Y,1,4,41.871940,North,Spring
4619,1721.06.00,ITALY,Swimming,M,Y,1,6,41.871940,North,Summer
4620,1703.03.26,BARBADOS,Swimming,M,N,0,3,13.193887,North,Spring

## Para la hipotesis 3: limpiar columna activity

In [75]:
#aplico esta condiciÃ³n para que poder transformar todos los valores que sean strings sin tener que dropear los nan de la columna activity
# pd.isna(i) verifica si el el valor es nan, en caso que lo sea devuelve el nan y sino lo es aplica la lambda
df5.activity = df5.activity.apply(lambda i : i.lower().rstrip().lstrip() if not pd.isna(i) else i)
df5.shape

(4554, 10)

In [76]:
df5.activity.unique()

array(['paddling', 'standing', 'surfing', ...,
       'hbm magpie foundered in a squall', 'conch diver',
       'washing himself'], dtype=object)

Para limpiar la columna activity, uso un regex para encontrar todas aquellas strings que contengan un verbo en gerundio y acotar a valores que tengan sentido. La variable gerundio me devuelve una lista de todas las substring que encuentra que sean un gerundio. En este caso, limito que la lista tenga solo una valor ya que sino es indeterminado, p.ej: surfing/bathing.

In [77]:

def extraer_gerundio(text):
    # encontrar los gerundios y solo quedarme con los que el len(gerundio) sea 1 
    gerundio = re.findall(r'\b\w+ing\b', str(text)) #devuelve una lista
    if len(gerundio) == 1:
        gerundio_str = ''.join(gerundio) #convertir gerundio en string
        return gerundio_str

# apply the function to the "activities" column and create a new column with the extracted gerunds
df5['activity'] = df5['activity'].apply(extraer_gerundio)
#Ver los valores unicos
df5.activity.value_counts()

surfing         877
swimming        773
fishing         492
diving          307
spearfishing    257
               ...
wakeboarding      1
wearing           1
dropping          1
bodyboarding      1
harassing         1
Name: activity, Length: 140, dtype: int64

In [78]:
df5.activity.unique()

array(['paddling', 'standing', 'surfing', 'diving', 'swimming', 'fishing',
       'walking', 'feeding', 'boarding', 'windsurfing', 'paddleboarding',
       'wading', 'cleaning', 'snorkeling', 'spearfishing', None,
       'bathing', 'kayaking', 'canoeing', 'skimboarding', 'touching',
       'attempting', 'kakaying', 'washing', 'grabbing', 'tagging',
       'floating', 'lobstering', 'teasing', 'photographing', 'skiing',
       'playing', 'sitting', 'bodysurfing', 'rowing', 'filming',
       'petting', 'kneeling', 'kitesurfing', 'sailing', 'kiteboarding',
       'casting', 'wrangling', 'bodyboarding', 'crayfishing', 'jumping',
       'wakeboarding', 'rescuing', 'measuring', 'sinking', 'treading',
       'removing', 'reviving', 'shrimping', 'holding', 'crouching',
       'boeing', 'killing', 'collecting', 'conducting', 'lying',
       'cruising', 'towing', 'watching', 'chumming', 'riding', 'sleeping',
       'freediving', 'stamding', 'preparing', 'finning', 'skindiving',
       'sittting', 'dropping', 'ditching', 'foundering', 'sailboarding',
       'morning', 'exercising', 'resting', 'clinging', 'drawing',
       'leaving', 'clamming', 'picking', 'pulling', 'netting',
       'lifesaving', 'splashing', 'hunting', 'throwing', 'spearing',
       'catching', 'testing', 'escaping', 'gathering', 'checking',
       'racing', 'helping', 'setting', 'during', 'trailing', 'hanging',
       'dragging', 'working', 'wearing', 'crabbing', 'retrieving',
       'landing', 'cutting', 'being', 'carrying', 'examining', 'guarding',
       'sculling', 'scooping', 'paddleskiing', 'hauling', 'launching',
       'boating', 'feeling', 'shelling', 'dismantling', 'stuffing',
       'taking', 'pearling', 'expecting', 'shooting', 'footing',
       'dangling', 'angling', 'fleeing', 'oystering', 'yachting',
       'restraining', 'traveling', 'burning', 'coming', 'trying',
       'deserting', 'harassing'], dtype=object)

Observo que hay 2035 valores Ãºnicos  y que muchos de ellos no son una acciÃ³n considerada una actividad como tal. p.ej: shooting, burning, trying, coming, being, examining, feeling, taking,... Por lo que limito la columna a aquella actividades que considero deportivas.

In [79]:
def activity_sports (x):
#Me quedo con la actividades deportivas 
    actividades_deporte =  ['surfing','diving','paddling','swimming','fishing','boarding','windsurfing','paddleboarding','snorkeling','spearfishing','kayaking','canoeing','sailing','bodysurfing','kitesurfing','kiteboarding']    
    if x in actividades_deporte:
        valor = x
    else: 
        valor = np.nan #si no se encuentra en la lista devuelvo nan, para despuÃ©s dropearlo
    return valor 

df5['activity'] = df5['activity'].apply(activity_sports)

QuitarÃ© los nans de la columna activity para realizar el anÃ¡lisi de la tercera hipÃ³tesis, pero para las otras no me influyen estos nans.

In [80]:
df5

,case_number,country,activity,sex,fatal,fatal_numerica,month,latitude,hemisphere,season
0,2018.06.25,USA,paddling,F,N,0,6,37.090240,North,Summer
1,2018.06.18,USA,NaN,F,N,0,6,37.090240,North,Summer
2,2018.06.09,USA,surfing,M,N,0,6,37.090240,North,Summer
3,2018.06.08,AUSTRALIA,surfing,M,N,0,6,-25.274398,South,Winter
4,2018.06.04,MEXICO,diving,M,N,0,6,23.634501,North,Summer
...,...,...,...,...,...,...,...,...,...,...
4616,1753.10.27,JAMAICA,NaN,M,Y,1,10,18.109581,North,Autumn
4617,1751.07.27,USA,swimming,M,Y,1,7,37.090240,North,Summer
4618,1738.04.06,ITALY,swimming,M,Y,1,4,41.871940,North,Spring
4619,1721.06.00,ITALY,swimming,M,Y,1,6,41.871940,North,Summer
4620,1703.03.26,BARBADOS,swimming,M,N,0,3,13.193887,North,Spring

In [81]:
df5.activity.isna().sum()

1567

## HipÃ³tesis 4: limpiar columna sex

In [83]:
df5.sex = df5.sex.apply(lambda i: i.rstrip().lstrip() if not pd.isna(i) else i)

In [84]:
df5.sex.unique()

array(['F', 'M', nan, 'lli', 'N', '.'], dtype=object)

In [85]:
df5 = df5.drop(df5[(df5['sex'] == 'lli') | (df5['sex'] == 'N')| (df5['sex'] == '.')].index)

In [86]:
df5.sex.isna().sum() #QuitarÃ© los nans de la columna activity para realizar el anÃ¡lisi de la tercera hipÃ³tesis, pero para las otras no me influyen estos nans.

334

In [ ]:
df5.to_csv ('C:/Users/manya/Documents/Ironhack/Course/Project-1/data/attacks-limpio.csv', index = False)